<h3>題目:利用迴圈,輸出對應的天干地支的年別</h3>
<pre>
天干：甲乙丙丁戊己庚辛壬癸
地支：子丑寅卯辰巳午未申酉戌亥
天干地支配對：甲子、乙丑、丙寅….甲戌、乙亥、丙子….
</pre>
<h4>同學版本</h4>
<?php
$a=array('甲','乙','丙','丁','戊','己','庚','辛','壬','癸');
$b=array('子','丑','寅','卯','辰','巳','午','未','申','酉','戌','亥');
$year=(int)-10016;
$inputyear=(int)2021;
$up=(int)(abs($inputyear-$year)%60)%10;
$low=(int)(abs($inputyear-$year)%60)%12;
print($a[$up]."".$b[$low]."年");
?>
<hr>
<h4>老師版本</h4>
<?php
/*$sky=[] , 是從0開始算 , 甲=0,乙=1,丙=2....*/ 
$sky=['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸'];
/*$land=[] , 是從0開始算 , 子=0,丑=1,辰=2....*/
$land=['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'];
$skyland2=[];

/*已知西元1024年為甲子年 ,所以減1024*/
/* 2022 是因為今年是2022年 */ 
$year=(2022-1024);

/* $sky[$year%10],因為 甲 - 癸 共10個,所以取10的餘數 */ 
/* $land[$year%12],因為 子 - 亥 共12個,所以取12的餘數 */ 
echo $sky[$year%10].$land[$year%12];

/* for(起始值;執行條件;遞增(減)*/
for($i=1024;$i<=2048;$i++){

    /*已知西元1024年為甲子年 ,所以減1024 */
    $year=$i-1024;
    $skyland2[$i]=$sky[$year%10] . $land[$year%12];
}

echo "<pre>";
print_r($skyland2);
echo "</pre>";

echo "西元2022年是 [".$skyland2[2022]."] 年";
?>