<h2>練習:給定兩個日期，計算中間間隔天數</h2>

<?php

$day1="2022-4-10";
$day2="2022-4-20";
echo "星期一=>".$day1."<br>";
echo "星期二=>".$day2."<br>";

$time1=strtotime($day1);
$time2=strtotime($day2);

echo $time1."秒數";
echo "<br>";
echo $time2."秒數";
echo "<br>";

//這邊要算間隔的天數
//第一天(2022-4-10)跟最後一天(2022-4-20)不能算進去
//因為2022-4-10,當天不要算進去,所以最後再減一個(24*60*60)
//一天的秒數=(24*60*60)
//但只會呈現秒數
$gap=($time2-$time1-(24*60*60));
//所以除以(60*60*24),會呈現天數
$gap=$gap/(60*60*24);


//這邊要算經過的天數
//2022-4-10是第一天,所以要算一天
//因為2022-4-10,這天要算進去,所以最後再加一個(24*60*60)
$duration=($time2-$time1+(24*60*60));
$duration=$duration/(60*60*24);

//這邊要算相差的天數
$diff=($time2-$time1);
$diff=$diff/(60*60*24);


echo "中間間隔".$gap."天";
echo "<br>";
echo "經過了".$duration."天";
echo "<br>";
echo "相差了".$diff."天";

?>